Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་སེམས་མ་བསྐྱེད་པའི་ས་དང་། རབ་ཏུ་དགའ་བ་དང་། དྲི་མ་མེད་པ་དང་། འོད་བྱེད་པ་དང་། འོད་འཕྲོ་བ་ཅན་དང་། ཤིན་ཏུ་དཀའ་རྒྱལ་དང་། མངོན་དུ་གྱུར་པ་དང་། རིང་དུ་སོང་བ་དང་། མི་གཡོ་བ་དང་། ལེགས་པའི་བློ་གྲོས་དང་། ཆོས་ཀྱི་སྤྲིན་དང་། སངས་རྒྱས་ཀྱི་ས་ཀུན་ཏུ་འོད་དེ། ས་བཅུ་གཉིས་པོ་དེ་ནི་དེ་དག་གོ།
en: They are the ground where the mind of awakening has been engendered, as well as the grounds of the Joyous, the Stainless , the Radiant , the Flaming , the Hard to Conquer , the Manifest , the Far Reaching , the Unshakable , the Excellent Intelligence , the Cloud of Dharma , and the buddhas’ ground of Universal Illumination. These are the twelve grounds.

source: དེ་ལ་བྱང་ཆུབ་ཀྱི་སེམས་མ་བསྐྱེད་པའི་ས་གང་ཞེ་ན།
en: “What, you may wonder, does the ground where the mind of awakening has been engendered consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱིས་པའི་སྤྱོད་པ་དང་། ལོག་པའི་ནན་ཏན་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ།
en: Upon this ground bodhisattvas are truly beyond all childish conduct and mistaken pursuits.

source: འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་ཀྱི་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཁྱད་ཞུགས་པའི་འགྲོ་བ་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ།
en: They are superior to Śakra, Brahmā, and the world guardians within the three worlds, as well as to all the hearers and solitary buddhas. They are above all wandering beings

source: རྣམ་པ་ཐམས་ཅད་དུ་དཔལ་དང་ལྡན་པའི་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ།
en: they are adorned with a glorious body, speech, and mind.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མུ་མེད་པ་སྣང་བར་བྱེད་པའི་འོད་ཀྱི་དཀྱིལ་འཁོར་དང་ལྡན་པ།
en: They possess the radiant halo that illumines infinitely many worlds in the ten directions,

source: སྒྲིབ་པ་མེད་པའི་སྟོབས་ཀྱི་ཤུགས་འཆང་བ།
en: they hold the power of freedom from obscuration.

source: འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པར་སྐད་ཅིག་རེ་རེ་ལ་འགྲོ་ཞིང་འོང་ན་
en: In every single instant they can visit and return from innumerable worlds.

source: དྲི་ཞིམ་པོ་དང་། འོད་ཟེར་གྱི་དྲ་བའི་ཚོགས་ཆེན་པོ་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་འབྱུང་བའི་པད་མས་རྐང་པ་ཡོངས་སུ་བརྟན་པ།
en: Their feet are stable, since fragrant and brilliant lotus flowers that grow throughout the four great continents support them.

source: སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མཐའ་དང་མཉམ་པའི་སྟན་གྱི་རྒྱན་དང་ལྡན་པ།
en: They possess a seat ornament that extends to the end of the thousandfold universe.

source: ཆོས་ཐམས་ཅད་ཤིན་ཏུ་རྣམ་པར་ནོན་པའི་ལྷག་མཐོང་རྣམ་པར་བསྒོམས་པས་ཐོགས་པ་མེད་ཅིང་
en: Due to their practice of special insight that sees through all phenomena, they are unimpeded.

source: ཡིད་དུ་འོང་བའི་དམིགས་པའི་མཚན་མ་ཆེན་པོ་བཅུ་ལ་སོགས་པ་གྲངས་མེད་པའི་ལྟས་བཟང་པོ་མཐོང་བ།
en: They perceive countless excellent signs, such as the ten great signs of having a delightful perspective.

source: ཕྱིར་མི་ལྡོག་པ།
en: Their progress is irreversible.

source: ཕྱོགས་ཀྱི་ནགས་ཚལ་ཐིབས་པོ་མཐའ་ཡས་པ་ཐམས་ཅད་དུ་འོད་ཀྱི་དྲ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་འགྱེད་པས་ཞིང་དཔག་ཏུ་མེད་པའི་རྒྱན་བྱེད་པ།
en: Since they illumine all dense forests everywhere with an inconceivable web of light, they beautify infinite realms.

source: འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་འཇིག་རྟེན་གྱི་མངའ་བདག་དཔག་ཏུ་མེད་པ་སྙེད་ཀྱི་བདག་གི་གཟུགས་བརྙན་གྱིས་དབང་བསྐུར་བ།
en: Their reflections empower countless worldly rulers throughout inexpressibly many universes.

source: ཡང་དག་པར་མནོད་པའི་དབང་དང་བྱིན་གྱི་རླབས་ལ་མཁས་པ།
en: They are skilled in power and blessings that conquer.

source: འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རིན་པོ་ཆེའི་ཆར་གྱི་སྣང་བའི་སྒོ་དཔག་ཏུ་མེད་པ་ཐམས་ཅད་གཏན་པ་མེད་པར་ཀུན་ཏུ་རྒྱས་པར་འགེངས་པའི་མཆོད་སྦྱིན་ཆེན་པོའི་སྤྲིན་གཏོང་བ་ལྷུར་བྱེད་པ།
en: They send out clouds of vast offerings that unstintingly fill up all endless appearances with a rain of precious mundane and supramundane qualities.

source: བལྟ་ན་བཟང་ཞིང་ཡིད་དུ་འོང་ལ་མཛེས་ཤིང་དགེ་ལ་
en: The sight of them is excellent, delightful, beautiful, and wholesome.

source: འགྲོ་བ་ཐམས་ཅད་དང་མི་འཐུན་པ་མེད་ཅིང་དོན་ཡོད་པར་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་
en: Without being offensive to anyone, any encounter with them is meaningful and fulfills all wishes.

source: འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་རབ་ཏུ་གཡོ་བར་བྱེད་ཅིང་
en: Such bodhisattvas stir innumerable world systems.

source: འགྲོ་བ་ངན་འགྲོ་ལ་སོགས་པ་ལས་སེམས་ཅན་མཐའ་ཡས་པ་ཡོངས་སུ་སྐྱོབ་པ།
en: They protect infinitely many beings from such miseries as the lower realms.

source: མཐའ་ཡས་པའི་སངས་རྒྱས་མཆོད་པ་དང་ཆོས་ཀྱི་སྒོ་འཛིན་ནུས་པ།
en: They worship limitless buddhas and are capable of upholding the gateways to Dharma.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། རྣམ་པར་ཐར་པ་དང་། མངོན་པར་ཤེས་པ་དང་། རིག་པ་གྲངས་མེད་པས་རྣམ་པར་རོལ་པ།
en: They revel in countless absorptions, retentions, liberations, superknowledges, and magical abilities.

source: ཆོས་མཐའ་ཡས་པ་ལ་དགའ་ཞིང་མོས་པས་ཟང་ཟིང་མེད་པར
en: With joy and inspiration toward the infinite Dharma they have no concern for material things,

source: ཕྱི་མའི་མཐའི་བསྐལ་པའི་མཐར་ཐུག་པར་རྣམ་པར་མི་རྟོག་ཅིང་ལྷུན་གྱིས་གྲུབ་པའི་དགའ་བའི་ཤུགས་ཀྱི་སྣང་བ་འཐོབ་པ
en: until the end of time they are free from concepts, having gained the illumination that is the power of spontaneously accomplished joy.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཐེར་འབུམ་དཔག་ཏུ་མེད་པར་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པའི་བསྒོམ་པ་སྣ་ཚོགས་ཡོངས་སུ་རྫོགས་ལ།
en: Throughout an immeasurable number of quintillions of eons they perfect all the various meditations contained in the Great Vehicle.

source: གཞན་གྱི་དོན་གྱི་ནན་ཏན་ཚར་ཕྱིན་པའི་བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་མངོན་པར་བསྒྲུབ་པར་གྲུབ་པའི་སྔོན་གྱི་སྦྱོར་བ་
en: In perfect pursuit of the welfare of others, they engage in the many preliminary practices for accomplishing merit and wisdom.

source: བརྒྱ་སྟོང་ཕུན་སུམ་ཚོགས་པའི་མོས་པ་ཆེན་པོའི་ཡང་ཆེན་པོས་སྤྱོད་པའི་ཆོས་ཉིད་ཀྱིས་ས་དང་པོ་དེ་མ་ཐག་ཏུ་འཐོབ་པར་གང་གནས་པ་
en: With the greatest and most perfect inspirations, they immediately proceed to attain the first ground by means of the intrinsic nature of their practice.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཀྱི་སེམས་མ་བསྐྱེད་པའི་སའོ།
en: Such is the bodhisattva ground where the mind of awakening has not been engendered.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ནི་མིའི་ཁ་དོག་ལས་འདས་ལ། ལྷའི་ཁ་དོག་ནི་མ་ཐོབ་པ་ཡིན་ཏེ།
en: “Noble son, as an analogy, the complexion of a universal emperor is finer than that of a human being, and yet it is not like that of a god.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འཇིག་རྟེན་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ཐམས་ཅད་ལས་ནི་འདས་པ་ཡིན། དོན་དམ་པའི་བྱངཆུབ་སེམས་དཔའི་ས་ནི་མ་ཐོབ་པ་ཡིན་ནོ།
en: Similarly, although these bodhisattvas are beyond all mundane beings, hearers, and solitary buddhas, they still have not attained the bodhisattvas’ ultimate ground.

source: སངས་རྒྱས་ཀྱི་ས་ཀུན་ཏུ་འོད་ནི་མཐའ་དང་དབུང་མེད་པ་མ་ལུས་པ་དྲི་མ་མེད་པའི་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ་སྟེ།
en: A buddha’s ground of Universal Illumination is beyond center and edge, and it masters all stainless qualities without exception.

source: ཀུན་ཏུ་ཤིན་ཏུ་ལྟ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཐམས་ཅད་ཐོབ་པར་བྱེད་པའི་མཚན་ཉིད་དོ།
en: Thus, in all regards extremely revered, it is characterized by accomplishing all the objectives of all beings.

source: དེ་ལ་ཏིང་ངེ་འཛིན་རྣམས་གང་ཞེ་ན།
en: “In this regard, you may wonder, what are the absorptions?

source: བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་རྣམས་ཏེ།
en: The following ten constitute the absorptions of the bodhisattvas:

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། རིན་ཆེན་ཀུན་ཏུ་འཕགས་པ་དང་། ཤིན་ཏུ་གནས་པ་དང་། མི་སྒུལ་བ་དང་། ཕྱིར་མི་ལྡོག་པ་དང་། རིན་ཆེན་འབྱུང་གནས་དང་། ཉི་མའི་འོད་ཀྱི་གཟི་བརྗིད་དང་། དོན་ཐམས་ཅད་གྲུབ་པ་དང་། ཡེ་ཤེས་སྒྲོན་མ་དང་། ད་ལྟར་གྱི་སངས་རྒྱས་མངོན་དུ་བཞུགས་པ་དང་། དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ཏེ། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་ནི་མཐའ་ཡས་སོ།
en: the universally superior jewel, the firm abode, the immovable, the irreversible , the jewel mine, the splendorous sunlight, the accomplishment of all objectives, the lamp of wisdom , the direct encounter with the buddhas of the present, and the heroic gait. These are among the bodhisattvas’ limitless absorptions.

source: གཟུངས་ནི་བཅུ་གཉིས་ཏེ། བཅུ་གཉིས་གང་ཞེ་ན།
en: “The retentions number twelve. What are those twelve?

source: འདི་ལྟ་སྟེ། དབང་བསྐུར་ལྡན་དང་། ཡེ་ཤེས་ལྡན་དང་། སྒྲ་དབྱངས་རྣམ་པར་དག་པ་དང་། མི་ཟད་པའི་ཟ་མ་ཏོག་དང་། འཁྱིལ་པ་མཐའ་ཡས་དང་། རྒྱ་མཚོའི་ཕྱག་རྒྱ་དང་། པད་མ་བཀོད་པ་དང་། ཆགས་པ་མེད་པའི་སྒོར་འཇུག་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམ་པར་གདོན་མི་ཟ་བ་ལ་འཇུག་པ་དང་། སངས་རྒྱས་ཀྱི་རྒྱན་གྱི་བྱིན་གྱིས་བརླབས་པ་དང་། ཁ་དོག་མཐའ་ཡས་པ་དང་། སངས་རྒྱས་ཀྱི་སྐུའི་ཁ་དོག་རྫོགས་པ་མངོན་པར་བསྒྲུབ་པའི་གཟུངས་ཏེ། དེ་དག་ལ་སོགས་པ་སྔ་མ་བཞིན་ནོ།
en: The anointment, the one with wisdom, the pure tune, the inexhaustible casket, the infinite spinning, the ocean-like seal, the lotus array, the entry to the unobstructed gate, the doubtless entry to the correct understandings, the blessing of the buddha ornaments, the limitless colors, and the accomplishment of the colors of the buddha body. There are these and other such retentions.

source: མངོན་པར་ཤེས་པ་ནི་དྲུག་སྟེ། དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལྷའི་མིག་དང་། ལྷའི་རྣ་བ་དང་། ཕ་རོལ་གྱི་སེམས་ཤེས་པ་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཤེས་པ་དང་། རྫུ་འཕྲུལ་མངོན་པར་ཤེས་པའི་ཤེས་པ་དང་། གང་ཟག་པ་ཟད་པར་ཤེས་པའི་མངོན་པར་ཤེས་པ་སྟེ་དྲུག་པོ་དེ་དག་གོ།
en: “There are six superknowledges: the divine eye, the divine ear, knowledge of the minds of others, knowledge of previous existences, knowledge of miracles, and knowledge of the exhaustion of a person’s defilements.

source: དབང་ནི་བཅུ་སྟེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “The ten masteries are as follows:

source: ཚེའི་ཚད་བསྐལ་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པར་བྱིན་གྱིས་རློབ་པས་ཚེ་ལ་དབང་བ་དང་།
en: mastery of life, as one’s lifespan is blessed to last for innumerable immeasurable eons;

source: ཏིང་ངེ་འཛིན་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་ལ་ངེས་པར་རྟོག་ཅིང་འཇུག་པའི་ཚུལ་གྱིས་སེམས་ལ་དབང་བ་དང་།
en: mastery of the mind, as one comprehends and enters an ineffable number of ineffable absorptions;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་བཀོད་པའི་རྒྱན་དུ་མས་བརྒྱན་པར་བྱིན་གྱིས་རློབ་པ་སྟོན་པའི་ཚུལ་གྱིས་ཡོ་བྱད་ལ་དབང་བ་དང་།
en: mastery of material things, as one displays the blessing of ornamenting all universes with beautifying arrays;

source: དུས་ཇི་བཞིན་དུ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་བྱིན་གྱིས་རློབ་པ་སྟོན་པས་ལས་ལ་དབང་བ་དང་།
en: mastery of karmic action, as one displays the blessing of ripening karma at the appropriate time;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སྐྱེ་བ་སྟོན་པས་སྐྱེ་བ་ལ་དབང་བ་དང་།
en: mastery of birth, as one displays birth in all realms of the world;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་གང་བ་སྟོན་པས་མོས་པ་ལ་དབང་བ་དང་།
en: mastery of inspiration, as one reveals all realms of the world to be full of buddhas;

source: དུས་དང་ཞིང་གང་དུ་འདོད་པར་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་སྟོན་པས་སྨོན་ལམ་ལ་དབང་བ་དང་།
en: mastery of aspirations, as one displays complete awakening at whichever time and place it may be desired;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་འཕྲུལ་པ་མཐའ་ཡས་པ་སྟོན་པས་རྫུ་འཕྲུལ་ལ་དབང་བ་དང་།
en: mastery of miracles, as one displays infinite miracles throughout all realms of the world;

source: ཆོས་ཀྱི་སྒོ་སྣང་བ་མཐའ་དང་དབུང་མེད་པ་ཡོངས་སུ་སྟོན་པས་ཆོས་ལ་དབང་བ་དང་།
en: mastery of Dharma, as one displays the light of the gateways to the Dharma beyond center and edge;

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། མ་འདྲེས་པ་དང་། མཚན་དང་། དཔེ་བྱད་བཟང་པོ་དང་། མངོན་པར་རྫོགས་པའི་བྱང་ཆུབ་དམ་པ་དང་། དུས་ཐམས་ཅད་དུ་གཏོགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་གྲངས་ལ་སོགས་པ་སྐད་ཅིག་གཅིག་ལ་ཡོངས་སུ་ཤེས་པ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་སྟོན་པས་ཡེ་ཤེས་ལ་དབང་བ་སྟེ།
en: With this mastery, there is instantaneously a complete knowledge of such areas as the thus-gone ones’ ten powers, fearlessnesses, correct understandings, unique qualities, excellent marks and signs, and sacred complete awakening, as well as the number of extremely subtle particles in all buddha realms throughout time.

source: བཅུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབང་རྣམས་སོ།
en: These are the bodhisattvas’ ten masteries.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་བཅུ་གང་ཞེ་ན།
en: “What, you may wonder, are the bodhisattvas’ ten powers?

source: འདི་ལྟ་སྟེ། བསམ་པའི་སྟོབས་དང་། ལྷག་པའི་བསམ་པའི་སྟོབས་དང་། སྦྱོར་བའི་སྟོབས་དང་། ཤེས་རབ་ཀྱི་སྟོབས་དང་། སྨོན་ལམ་གྱི་སྟོབས་དང་། སྤྱོད་པའི་སྟོབས་དང་། ཐེག་པའི་སྟོབས་དང་། རྣམ་པར་འཕྲུལ་བའི་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་སྟོབས་དང་། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བའི་སྟོབས་ཏེ། བཅུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་རྣམས་སོ།
en: They are the powers of intent, superior intent, application, insight, aspiration, action, vehicles, emanations, awakening, and the turning of the wheel of Dharma. These are the bodhisattvas’ ten powers.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་མི་འཇིགས་པ་བཞི་གང་ཞེ་ན།
en: “What, you may wonder, are the bodhisattvas’ four fearlessnesses?

source: གཟུངས་ཀྱིས་ཐོས་པ་འཛིན་ཅིང་དོན་བསྟན་པ་ལ་མི་འཇིགས་པ་དང་།
en: Through their retention, they are fearless in upholding and teaching the meaning of what they have heard.

source: བསྲུང་བ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པའི་མི་འཇིགས་པ་དང་།
en: They are fearless due to their perfect full protection,

source: རང་བཞིན་གྱིས་སྤྱོད་ལམ་སྨད་དུ་མེད་པའི་ལས་གསུམ་ཡོངས་སུ་དག་པའི
en: which consists of the purified three actions whereby their conduct is naturally irreproachable.

source: བདག་མེད་པ་ཁོང་དུ་ཆུད་པས་གཞན་གྱིས་གཙེ་བའི་མཚན་མ་མི་འབྱུང་ཞིང་
en: This occurs due to their comprehension of the absence of self, which ensures that they have no experience of being harmed.

source: ཆོས་བཟུང་བ་ཡུན་དུ་མི་བརྗེད་པ་དང་།
en: They are also fearless since they never forget the Dharma that they have received,

source: ཐབས་དང་ཤེས་རབ་མཐར་ཕྱིན་པས་སེམས་ཅན་སྒྲོལ་ཞིང་དད་པ་སྟོན་པ་དང་།
en: they liberate sentient beings and inspire them with faith through perfecting means and insight,

source: དགེ་བའི་བར་ཆད་དུ་མི་འགྱུར་བའི་
en: since they avoid any obstacles to virtue.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་མ་ཉམས་ཤིང་ཐེག་པ་གཞན་གྱིས་མི་འབྱུང་བར་དབང་ཡོངས་སུ་རྫོགས་པ་དང་། སེམས་ཅན་གྱི་དོན་རྣམ་པ་ཐམས་ཅད་དུ་ཡང་དག་པར་ཐོབ་པར་བྱ་བ་ལ་མི་འཇིགས་པ་སྟེ།
en: Finally, they are fearless due to their perfect mastery in never straying from the omniscient mind and avoiding the influence of other vehicles while accomplishing the true purpose of all beings.

source: བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་མི་འཇིགས་པ་རྣམས་སོ།
en: These four are the bodhisattvas’ fearlessnesses.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་གང་ཞེ་ན།
en: “What, you may wonder, are the bodhisattvas’ eighteen unique qualities?

source: མ་བསྟན་པའི་སྦྱིན་པ་ཅན་རྣམས་ཡིན། མ་བསྟན་པའི་ཚུལ་ཁྲིམས་ཅན་རྣམས་དང་། མ་བསྟན་པའི་བཟོད་པ་ཅན་རྣམས་དང་། མ་བསྟན་པའི་བརྩོན་འགྲུས་ཅན་རྣམས་དང་། མ་བསྟན་པའི་བསམ་གཏན་ཅན་རྣམས་དང་། མ་བསྟན་པའི་ཤེས་རབ་ཅན་རྣམས་དང་།
en: the possession of untaught generosity, untaught discipline, untaught patience, untaught diligence, untaught concentration, and untaught insight.

source: བསྡུ་བའི་དངོས་པོས་སེམས་ཅན་ཐམས་ཅད་སྡུད་པ་རྣམས་དང་།
en: Furthermore, they consist of gathering sentient beings by the means of attraction;

source: ཡོངས་སུ་བསྔོ་བའི་ཆོ་ག་ཤེས་པ་རྣམས་དང་།
en: knowing the proper way of dedication;

source: ཐབས་ལ་མཁས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པའི་དབང་གི་ཐེག་པའི་མཆོག་གིས་འབྱུང་བ་སྟོན་པ་རྣམས་དང་།
en: skillfully teaching by means of the supreme vehicle in which the conduct of all beings is mastered;

source: ཐེག་པ་ཆེན་པོ་ལས་མ་ཉམས་པ་རྣམས་དང་།
en: not regressing from the Great Vehicle;

source: མྱ་ངན་ལས་འདས་པའི་སྒོ་སྟོན་པ་རྣམས་དང་།
en: showing the gateways to cyclic existence and the transcendence of suffering;

source: ཟུང་དང་སྣྲེལ་ཞིའི་རྒྱུད་ལ་མཁས་པ་རྣམས་དང་།
en: being expert in uttering reverse and inverse sounds;

source: ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་མངོན་པར་འདུ་མི་བྱེད་ཅིང་ཁ་ན་མ་ཐོ་བ་མེད་པར་ཚེ་རབས་ཐམས་ཅད་དུ་མངོན་པར་འཕགས་པ་རྣམས་དང་།
en: avoiding formation by means of a preceding wisdom and being truly elevated throughout all lives without any evil;

source: ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཀྱི་མཐའ་དགེ་བ་བཅུ་དང་ལྡན་པ་རྣམས་དང་།
en: possessing the ten virtuous actions in all physical, verbal, and mental pursuits;

source: སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཐམས་ཅད་བཟོད་པའི་ལུས་ལེན་པས་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བ་རྣམས་དང་།
en: never abandoning the realms of sentient beings through assuming a body that can tolerate any amount of suffering;

source: འགྲོ་བ་ཐམས་ཅད་མངོན་པར་དགའ་བར་སྟོན་པ་རྣམས་དང་།
en: teaching all sentient beings joyfully;

source: བྱིས་པ་དང་། ཉན་ཐོས་མི་བཟད་པ་ཇི་སྙེད་ཅིག་གི་ནང་ན་ཡང་དགེ་བ་མང་པོའི་རིན་པོ་ཆེའི་ཤིང་དཔག་བསམ་ལྟར་བརྟན་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ཡོངས་སུ་མ་ཉམས་པ་རྣམས་དང་།
en: protecting the mind of omniscience from any degeneration by remaining steadfast like a precious wish-fulfilling tree of abundant virtues, even in the midst of terrifying infantile beings and hearers;

source: ཆོས་ཐམས་ཅད་ཀྱི་ཐབས་སྦྱིན་པས་དབང་བསྐུར་བ་ཐོབ་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་བཙལ་བ་བསྟན་པ་ལས་མི་ལྡོག་པ་རྣམས་ཏེ།
en: and granting methods for the entire Dharma in the pursuit of buddha qualities, without ever turning away from the teaching so that they can become anointed.

source: བཅྭ་བརྒྱད་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སོ།
en: These are the bodhisattvas’ eighteen unique qualities.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་གང་ཞེ་ན།
en: “What, you may wonder, are the ten powers of the thus-gone ones?

source: འདི་ལྟ་སྟེ། གནས་དང་གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་དང་། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་གྱི་ལས་ཀྱི་རྒྱུའི་རྣམ་པར་སྨིན་པ་ལེན་པ་མཁྱེན་པའི་སྟོབས་དང་། མོས་པ་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་དང་། ཁམས་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་དང་། དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་དང་། ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་མཁྱེན་པའི་སྟོབས་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། རྣམ་པར་ལྡང་བ་ཐམས་ཅད་མཁྱེན་པའི་སྟོབས་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མཁྱེན་པའི་སྟོབས་དང་། འཆི་འཕོ་དང་སྐྱེ་བ་མཁྱེན་པའི་སྟོབས་དང་། ཟག་པ་ཟད་པར་མཁྱེན་པའི་སྟོབས་ཏེ། བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་སོ།
en: They are the power to know what is proper and what is improper; the power to know the continued ripening of all causes related to acts in the past, future, and present; the power to know diverse inclinations; the power to know diverse constitutions; the power to know higher and lower faculties; the power to know the paths for all destinations; the power to know all concentrations, liberations, absorptions, attainments, afflictions, purifications, and arisings; the power to know past existences; the power to know death and rebirth; and the power to know the exhaustion of defilements. These are the ten powers of the thus-gone ones.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་གང་ཞེ་ན།
en: “What, you may wonder, are the thus-gone ones’ four fearlessnesses?

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ལ་མི་འཇིགས་པ་དང་། ཟག་པ་ཐམས་ཅད་ཟད་པར་ཤེས་པ་ལ་མི་འཇིགས་པ་དང་། བར་དུ་གཅོད་པའི་ཆོས་རྣམས་གཞན་དུ་མི་འགྱུར་བར་ངེས་པའི་ལུང་བསྟན་པ་ལ་མི་འཇིགས་པ་དང་། ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཐོབ་པར་འགྱུར་བའི་འབྱུང་བའི་ལམ་དེ་བཞིན་དུ་འགྱུར་བ་ལ་མི་འཇིགས་པ་སྟེ། བཞི་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་རྣམས་སོ།
en: They are fearlessness with regard to the full realization of all phenomena; fearlessness in knowing the exhaustion of all defilements; fearlessness in giving definitive declarations that precisely identify all obstructive phenomena; and fearlessness in terms of actualizing the path that leads to the attainment of all perfect qualities. These four are the thus-gone ones’ four fearlessnesses.

source: འཁྲུལ་བ་མེད་པ་དང་། ཅ་ཅོ་མེད་པ་དང་། བསྙེལ་བ་མེད་པ་དང་།
en: freedom from mistakes; freedom from impediments of speech; freedom from forgetfulness;

source: སེམས་མཉམ་པར་མ་བཞག་པ་མེད་པ་དང་།
en: never lacking equipoise;

source: ཐ་དད་པའི་འདུ་ཤེས་མེད་པ་དང་།
en: absence of distinct perceptions;

source: སོ་སོར་མ་བརྟགས་པའི་བཏང་སྙོམས་མེད་པ་དང་།
en: freedom from unexamined neutrality;

source: མོས་པ་ཉམས་པ་མེད་པ་དང་།
en: undiminished intent;

source: བརྩོན་འགྲུས་ཉམས་པ་མེད་པ་དང་།
en: undiminished diligence;

source: དྲན་པ་ཉམས་པ་མེད་པ་དང་། ཏིང་ངེ་འཛིན་ཉམས་པ་མེད་པ་དང་།
en: undiminished mindfulness; undiminished absorption;

source: ཤེས་རབ་ཉམས་པ་མེད་པ་དང་། རྣམ་པར་གྲོལ་བ་ཉམས་པ་མེད་པ་དང་།
en: undiminished insight; undiminished liberation;

source: འདས་པའི་དུས་ལ་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་པ་དང་། མ་འོངས་པའི་དུས་ལ་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་པ་དང་། ད་ལྟར་གྱི་དུས་ལ་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་པ་དང་།
en: unattached and unimpeded wisdom vision of the past; unattached and unimpeded wisdom vision of the future; unattached and unimpeded wisdom vision of the present;

source: ལུས་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ངག་གི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ཡིད་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་སྟེ།
en: physical actions all being preceded by and agreeing with wisdom; verbal actions all being preceded by and agreeing with wisdom; and mental actions all being preceded by and agreeing with wisdom.

source: བཅྭ་བརྒྱད་པོ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སོ།
en: These eighteen are the thus-gone ones’ unique qualities.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་གང་ཞེ་ན།
en: “What, you may wonder, does the great compassion of thus-gone ones consist in?

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་ནི་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ཏུ་བསམ་གྱིས་མི་ཁྱབ་པའི་རང་བཞིན་དུ་འབྱུང་སྟེ།
en: Noble son, the thus-gone ones’ great compassion is endowed with thirty-two features and appears in an inconceivable manner throughout all the infinite universes in the ten directions.

source: སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these thirty-two features? They are as follows:

source: ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་བདག་མེད་པར་མ་མོས་པས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are devoid of self and yet sentient beings are not interested.

source: ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་སེམས་ཅན་དུ་སྨྲའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are devoid of a sentient being and yet sentient beings speak of ‘sentient beings.’

source: ཆོས་ཐམས་ཅད་ནི་སྲོག་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་སྲོག་ཏུ་སྨྲའོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are devoid of a life force and yet sentient beings speak of ‘a life force.’

source: ཆོས་ཐམས་ཅད་ནི་གང་ཟག་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་གང་ཟག་ལ་གནས་པའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are devoid of a person and yet sentient beings believe they are persons.

source: ཆོས་ཐམས་ཅད་ནི་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་ཡོད་པར་ལྟའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are nonexistent and yet sentient beings regard them as existent.

source: ཆོས་ཐམས་ཅད་ནི་གནས་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་གནས་ལ་རྟེན་ཏོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are devoid of location and yet sentient beings believe that they are present at locations.

source: ཆོས་ཐམས་ཅད་ནི་གཞི་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་གཞི་ལ་དགའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are baseless and yet sentient beings take delight in bases.

source: ཆོས་ཐམས་ཅད་ནི་ང་ཡིར་བྱ་བ་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་ང་ཡིར་བྱ་བ་ལ་རྟེན་ཏོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since phenomena cannot belong to anyone and yet sentient beings think they can make things their own.
